Revit 2027 API
BuiltInFailures.PipingFailures.CircularLoopInPipeSizing Property
 Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularLoopInPipeSizing { get; }
Public Shared ReadOnly Property CircularLoopInPipeSizing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularLoopInPipeSizing {
	FailureDefinitionId^ get ();
}
static member CircularLoopInPipeSizing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace